In [212]:
import pandas as pd
import numpy as np

df = pd.read_csv('files/test_start_time.csv')
df

  testcase start_time key     value
0       t1         s1  k1       Low
1       t2         s2  k1      High
2       t1         s3  k2  Critical
3       t4         s4  k2    Medium
4       vw        rvv  ef       Low

In [213]:
df_map = {'Critical':1,'High':2,'Medium':3,'Low':4}

In [225]:
df_map.values()

[2, 1, 3, 4]

In [219]:
df['mapped'] = df['value']

In [198]:
df

  testcase start_time key     value
0       t1         s1  k1       Low
1       t2         s2  k1      High
2       t1         s3  k2  Critical
3       t4         s4  k2    Medium
4       vw        rvv  ef       Low

In [189]:
for i in a_list:
    if 'mapped' not in df.columns:
        df['mapped'] = df['value']== i[0]
        print df['mapped']
        df['mapped'].replace(True,i[1], inplace=True)
        print df['mapped']
    else:
        #df['temp'] = df['mapped'] == 0.0
        df['temp'] = (df['mapped'] == 0.0) & (df['value']== i[0])
        print df['temp']
        df['mapped'].replace(True,i[1], inplace=True)

0    False
1    False
2     True
3    False
4    False
Name: mapped, dtype: bool
0    0.0
1    0.0
2    1.0
3    0.0
4    0.0
Name: mapped, dtype: float64
0    False
1     True
2    False
3    False
4    False
Name: temp, dtype: bool
0    False
1    False
2    False
3     True
4    False
Name: temp, dtype: bool
0     True
1    False
2    False
3    False
4     True
Name: temp, dtype: bool

In [190]:
df

  testcase start_time key     value  mapped   temp
0       t1         s1  k1       Low     0.0   True
1       t2         s2  k1      High     0.0  False
2       t1         s3  k2  Critical     2.0  False
3       t4         s4  k2    Medium     0.0  False
4       vw        rvv  ef       Low     0.0   True

In [191]:
df = pd.DataFrame({'col2': {0: 'a', 1: 2, 2: np.nan}, 'col1': {0: 'w', 1: 1, 2: 2}})
di = {1: "A", 2: "B"}

In [192]:
df

  col1 col2
0    w    a
1    1    2
2    2  NaN

In [193]:
di

{1: 'A', 2: 'B'}

In [220]:
df.replace({"mapped": df_map}, inplace=True)

In [223]:
df.sort_values(by=['mapped'])

  testcase start_time key     value  mapped
2       t1         s3  k2  Critical       1
1       t2         s2  k1      High       2
3       t4         s4  k2    Medium       3
0       t1         s1  k1       Low       4
4       vw        rvv  ef       Low       4

In [105]:
multicol1 = pd.MultiIndex.from_tuples([('weight', 'kg'), ('weight', 'pounds')])
df_multi_level_cols1 = pd.DataFrame([[1, 2], [2, 4]], index=['cat', 'dog'],columns=multicol1)

In [106]:
multicol1

MultiIndex(levels=[[u'weight'], [u'kg', u'pounds']],
           labels=[[0, 0], [0, 1]])

In [107]:
df_multi_level_cols1

    weight
        kg pounds
cat      1      2
dog      2      4

In [112]:
t1 = tuple(set(df['key']))
t2 = tuple(set(df['start_time']))
m = pd.MultiIndex.from_tuples([t2])
i = list(df['testcase'])
dd = pd.DataFrame(df['val'], index=i,columns=m)
dd

     s3
     s2
     s1
     s6
     s5
     s4
t1  NaN
t2  NaN
t3  NaN
t4  NaN
t5  NaN
t6  NaN

In [129]:
#df.set_index('testcase', inplace=True)

In [133]:
gb = df.groupby('key')
for i,j in gb:
    print j.pivot(columns='start_time')

            key            val
start_time   s4   s5   s6   s4   s5   s6
testcase
t4           k1  NaN  NaN   v4  NaN  NaN
t5          NaN   k1  NaN  NaN   v5  NaN
t6          NaN  NaN   k1  NaN  NaN   v6
            key            val
start_time   s1   s2   s3   s1   s2   s3
testcase
t1          k10  NaN  NaN   v1  NaN  NaN
t2          NaN  k10  NaN  NaN   v2  NaN
t3          NaN  NaN  k10  NaN  NaN   v3

In [174]:
dd = df.pivot(columns='start_time', values='val')
dd

start_time   s1   s2   s3   s4   s5   s6
0            v1  NaN  NaN  NaN  NaN  NaN
1           NaN   v2  NaN  NaN  NaN  NaN
2           NaN  NaN   v3  NaN  NaN  NaN
3           NaN  NaN  NaN   v4  NaN  NaN
4           NaN  NaN  NaN  NaN   v5  NaN
5           NaN  NaN  NaN  NaN  NaN   v6

In [175]:
dd['key2'] = df['key']
dd

start_time   s1   s2   s3   s4   s5   s6 key2
0            v1  NaN  NaN  NaN  NaN  NaN  k10
1           NaN   v2  NaN  NaN  NaN  NaN  k10
2           NaN  NaN   v3  NaN  NaN  NaN  k10
3           NaN  NaN  NaN   v4  NaN  NaN   k1
4           NaN  NaN  NaN  NaN   v5  NaN   k1
5           NaN  NaN  NaN  NaN  NaN   v6   k1

In [167]:
#df.pivot(index='date', columns='variable', values='value')

In [23]:
k = []
t = []
print df.columns
for c in df.columns:
    a = c.split('/',1)
    k.append(a[1])
    t.append(a[0])

Index([u'start_time/key', u'st1/c', u'st2/c/gh', u'st3/c', u'st4/c', u'st5/c'], dtype='object')

In [24]:
k, t

(['key', 'c', 'c/gh', 'c', 'c', 'c'],
 ['start_time', 'st1', 'st2', 'st3', 'st4', 'st5'])

In [25]:
header_row=['Last name',   'First name',   'Age']
print  '<td>'+'</td><td>'.join(header_row) + '</td>'

<td>Last name</td><td>First name</td><td>Age</td>

In [44]:
dff = df[['testcase','st/key','value']]

In [45]:
dff

  testcase st/key value
0       t1  s1/k1    v1
1       t2  s2/k2    v2
2       t1  s3/k3    v3
3       t4  s4/k4    v4

In [49]:
dd = dff.set_index(['testcase','st/key'])

In [52]:
df.columns

Index([u'testcase', u'start_time', u'key', u'value', u'st/key'], dtype='object')

In [3]:
X = ["a", "b", "c", "d", "e", "f", "g", "h", "i"]
Y = [ 0,   1,   1,    0,   1,   2,   2,   0,   1]

Z = [x for _,x in sorted(zip(Y,X))]
print(Z)

['a', 'd', 'h', 'b', 'c', 'e', 'i', 'f', 'g']